ClientTest/Xml/AirShoppingRQ0.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header />
  <S:Body>
    <AirShoppingRQ xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="16.1" xmlns="http://www.iata.org/IATA/EDIST">
      <Document>
        <Name>BA</Name>
      </Document>
      <Party>
        <Sender>
          <TravelAgencySender>
            <Contacts>
              <Contact>
                <EmailContact>
                  <Address>ndc@ba.com</Address>
                </EmailContact>
              </Contact>
            </Contacts>
            <IATA_Number>91210092</IATA_Number>
            <AgencyID>Travel Centre Clapham Limited</AgencyID>
          </TravelAgencySender>
        </Sender>
      </Party>
      <Travelers>
        <Traveler>
          <AnonymousTraveler>
            <PTC>ADT</PTC>
            <Age>
              <BirthDate>1988-06-07</BirthDate>
            </Age>
          </AnonymousTraveler>
        </Traveler>
        <Traveler>
          <AnonymousTraveler>
            <PTC>CHD</PTC>
            <Age>
              <BirthDate>2013-06-07</BirthDate>
            </Age>
          </AnonymousTraveler>
        </Traveler>
      </Travelers>
      <CoreQuery>
        <OriginDestinations>
          <OriginDestination>
            <Departure>
              <AirportCode>LHR</AirportCode>
              <Date>2018-06-26</Date>
            </Departure>
            <Arrival>
              <AirportCode>DME</AirportCode>
            </Arrival>
          </OriginDestination>
          <OriginDestination>
            <Departure>
              <AirportCode>DME</AirportCode>
              <Date>2018-06-29</Date>
            </Departure>
            <Arrival>
              <AirportCode>LHR</AirportCode>
            </Arrival>
          </OriginDestination>
        </OriginDestinations>
      </CoreQuery>
      <Preference>
        <FarePreferences>
          <Types>
            <Type>
              <Code>759</Code>
            </Type>
          </Types>
        </FarePreferences>
        <CabinPreferences>
          <CabinType>
            <Code>5</Code>
          </CabinType>
        </CabinPreferences>
      </Preference>
    </AirShoppingRQ>
  </S:Body>
</S:Envelope>